# Parameters
nc: 5  # number of classes
nc_grid: 3
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [ 99,37, 46,195, 256,62 ]  # P3/8
  - [ 52,620, 568,73, 78,585 ]  # P4/16
  - [ 528,142, 211,560, 416,530 ]  # P5/32

# backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)

  ]

# grid head
grid_head:
  [ [ 4,1,Conv,[ 256,3,2 ] ],
    [ -1,1,C3,[ 256,False ] ],
    [ 6,1,Conv,[ 256,1,1 ] ],
    [ [ -1,25 ],1,Concat,[ 1 ] ], #27(16,medium)
    [ -1,1,Conv,[ 512,3,2 ] ],
    [ -1,1,C3,[ 512,False ] ],
    [ 8,1,Conv,[ 512,1,1 ] ],
    [ [ -1,29 ],1,Concat,[ 1 ] ], #31(32,large)
    [ -1,1,C3,[ 1024,False ] ],
    [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
    [ 32,1,GridDetect,[ nc_grid,20,20 ] ],
    [ [-1, 33],1,FinalDetect,[] ],
  ]
